{
  "mailPositive": "Por favor, ingrese el código que recibió en %VAR% (Compruebe la carpeta de spam si no recibe un código).",
  "mailNegative": "No se puede enviar correo electrónico a %VAR%",
  "mailBlacklisted": "Tu correo electrónico está en la lista negra",
  "roleAdded": "Se agregó el rol %VAR%",
  "mailInvalid": "Por favor ingrese solo direcciones de correo electrónico válidas",
  "mailTimeout": "Por favor, espere %VAR% segundos antes de volver a enviar el correo electrónico.",
  "invalidPermissions": "¡No tienes permiso para ejecutar este comando!",
  "commandFailed": "¡Hubo un error al ejecutar este comando!",
  "userRetry": "Se produjo un error. Elimine y agregue la reacción para volver a intentarlo.",
  "userBotError": "El bot no está configurado correctamente. ¡Comuníquese con el administrador!",
  "userEnterEmail": "Por favor ingrese su dirección de correo electrónico para verificar %VAR%.",
  "userCantFindRole": "No puedo encontrar roles. ¡Por favor, comuníquese con el administrador! Ayuda: Asegúrese de que el nombre siga siendo el mismo y que el rol del bot sea más alto en el menú de roles de configuración del servidor que el rol verificado y no verificado",
  "emailText": "¡Bienvenido a %VAR%!\nAquí está su código de acceso: %VAR%\n\nNo comparta este código con nadie.",
  "errorGenericTitle": "❌ Ocurrió un Error",
  "errorGenericDescription": "Algo salió mal al procesar tu solicitud. El administrador del servidor ha sido notificado y lo revisará.",
  "errorFieldGuild": "Servidor",
  "errorFieldUser": "Usuario",
  "errorFallbackWarning": "⚠️ Notificación de Respaldo",
  "errorNotifyChannelFailed": "El canal de errores configurado ya no existe o el bot no puede enviar mensajes allí. El error se envió al propietario. Por favor reconfigure usando `/set_error_notify`.",
  "errorNotifyUserFailed": "El usuario configurado para notificaciones ya no está en el servidor o tiene los DMs desactivados. El error se envió al propietario. Por favor reconfigure usando `/set_error_notify`.",
  "errorNotifySetOwner": "✅ Las notificaciones de error ahora se enviarán al propietario del servidor por DM.",
  "errorNotifySetChannel": "✅ Las notificaciones de error ahora se enviarán a #%VAR%.",
  "errorNotifySetUser": "✅ Las notificaciones de error ahora se enviarán a %VAR% por DM.",
  "errorNotifyInvalidChannel": "❌ Por favor seleccione un canal de texto para las notificaciones de error.",
  "errorNotifyUserNotInGuild": "❌ El usuario seleccionado no es miembro de este servidor.",
  "errorNotifyStatusTitle": "📋 Configuración de Notificaciones de Error",
  "errorNotifyStatusOwner": "Las notificaciones de error se envían al **propietario del servidor** (%VAR%) por DM.",
  "errorNotifyStatusChannel": "Las notificaciones de error se envían a **#%VAR%**.",
  "errorNotifyStatusChannelInvalid": "⚠️ Las notificaciones están configuradas para un canal que ya no existe. Se usará el propietario del servidor.",
  "errorNotifyStatusUser": "Las notificaciones de error se envían a **%VAR%** por DM.",
  "errorNotifyStatusUserInvalid": "⚠️ Las notificaciones están configuradas para un usuario que ya no está en el servidor. Se usará el propietario del servidor.",
  "errorNotifyStatusNote": "ℹ️ Nota",
  "errorNotifyStatusNoteValue": "Si el método de notificación configurado falla, los errores se enviarán automáticamente al propietario del servidor.",
  "errorRoleAssignTitle": "Error de Asignación de Rol",
  "errorRoleAssignMessage": "No se pudo asignar el rol verificado/no verificado a un usuario. Por favor asegúrese de:\n• El rol del bot está más alto que los roles verificado/no verificado\n• Los roles todavía existen\n• El bot tiene el permiso 'Gestionar Roles'",
  "errorBotNotConfiguredTitle": "Bot No Configurado",
  "errorBotNotConfiguredMessage": "Un usuario intentó verificarse pero el bot no está configurado correctamente.\n\n**Configuración requerida:**\n• Establecer dominios de email permitidos con `/domains`\n• Establecer rol verificado con `/verifiedrole`\n\nEjecute `/status` para verificar la configuración actual."
}
